#include <iostream>
#include <stdio.h>

using namespace std;
int main() 
{
	setlocale(LC_ALL, "rus");
	char name1[9], name2[9], name3[9];
	char tip1, tip2, tip3;
	float val1, val2, val3;
	unsigned short n1, n2, n3;
	printf("1. Введите: Наименование, тип товара, цена за шт, кол-во в партии >");
	scanf("%s %c %f %hu", name1, &tip1, &val1, &n1);
	printf("2. Введите: Наименование, тип товара, цена за шт, кол-во в партии >");
	scanf("%s %c %f %hu", name2, &tip2, &val2, &n2);
	printf("3. Введите: Наименование, тип товара, цена за шт, кол-во в партии >");
	scanf("%s %c %f %hu", name3, &tip3, &val3, &n3);
	
	
	printf("--------------------------------------------------------------------------------------\n");
	printf("|                                        Прайс лист                                  |\n");
	printf("|------------------------------------------------------------------------------------|\n");
	printf("| Наименование товара | Тип товара | Цена за 1 шт. | Минимальное количество в партии |\n");
	printf("|                     |            |     (грн)     |                                 |\n");
	printf("|---------------------|------------|---------------|---------------------------------|\n");
	
	printf("| %-20s| %-11c| %-14.2f| %-32hu|\n", name1, tip1, val1, n1);
	printf("| %-20s| %-11c| %-14.2f| %-32hu|\n", name2, tip2, val2, n2);
	printf("| %-20s| %-11c| %-14.2f| %-32hu|\n", name3, tip3, val3, n3);

	printf("|------------------------------------------------------------------------------------|\n");
	printf("| Примечание: К-Канцтовары, О-Оргтехника                                             |\n");
	printf("--------------------------------------------------------------------------------------\n");
	return 0;
}