#define _CRT_SECURE_NO_WARNINGS
#include <iostream>
#include <stdio.h>

using namespace std;
int main() 
{
	setlocale(LC_ALL, "rus");
	char name1[6] = "Папка", name2[7] = "Бумага", name3[12] = "Калькулятор";
	char tip1[] = "К", tip2[] = "К", tip3[] = "О";
	float val1 = 4.75, val2 = 13.90, val3 = 411.00;
	unsigned short n1 = 4, n2 = 10, n3 = 1;
	/*printf("1. Введите: Наименование, тип товара, цена за шт, кол-во в партии >");
	scanf("%s %c %f %hu", name1, &tip1, &val1, &n1);
	printf("2. Введите: Наименование, тип товара, цена за шт, кол-во в партии >");
	scanf("%s %c %f %hu", name2, &tip2, &val2, &n2);
	printf("3. Введите: Наименование, тип товара, цена за шт, кол-во в партии >");
	scanf("%s %c %f %hu", name3, &tip3, &val3, &n3);*/
		
	printf("-----------------------------------------------------------------------------\n");
	printf("|                                Прайс лист                                 |\n");
	printf("|---------------------------------------------------------------------------|\n");
	printf("| Наименование товара | Тип товара | Цена за 1 шт. | Минимальное количество |\n");
	printf("|                     |            |     (грн)     |       в партии         |\n");
	printf("|---------------------|------------|---------------|------------------------|\n");
	
	printf("| %-20s| %-11s| %-14.2f| %-32hu|\n", name1, tip1, val1, n1);
	printf("| %-20s| %-11s| %-14.2f| %-32hu|\n", name2, tip2, val2, n2);
	printf("| %-20s| %-11s| %-14.2f| %-32hu|\n", name3, tip3, val3, n3);

	printf("|---------------------------------------------------------------------------|\n");
	printf("| Примечание: К-Канцтовары, О-Оргтехника                                    |\n");
	printf("-----------------------------------------------------------------------------\n");
	return 0;
}